import React from 'react';
import { Card } from 'react-bootstrap';
import Ec from './Ec'

export default function() {
    const option = {
        toolbox: {
            show : true,
            feature : {
                dataView : {show: true, readOnly: false},
                restore : {show: true},
                saveAsImage : {show: true}
            }
        },
        tooltip: {
            formatter: function (params) {
                    return [
                        '学科组合：' + params.data[0],
                        '选择' + params.data[2] + '的学生比例：' + params.data[1] + '%'
                    ].join('<br/>')
            }
            
        },
        xAxis : [
            {
                type : 'category',
                name: '学科组合'
            }
        ],
        yAxis : [
            {
                type : 'value',
                name: '百分比 %'
            }
        ],
        series : [
            {
                type:'bar',
                stack: 'All',
                label: {
                    normal: {
                        fontSize: 9,
                        show: true,
                        align: 'center'
                    }
                },
                itemStyle: {
                    color: '#ff9797'
                },
                data: [['物理+化学+政治', 15.63, '物理'], ['物理+化学+历史', 15.63, '物理'], ['物理+化学+生物', 15.63, '物理'], ['物理+化学+地理', 15.63, '物理'], ['物理+化学+技术', 15.63, '物理'], ['物理+政治+历史', 15.63, '物理'], ['物理+政治+生物', 15.63, '物理'], ['物理+政治+地理', 15.63, '物理'], ['物理+政治+技术', 15.63, '物理'], ['物理+历史+生物', 15.63, '物理'], ['物理+历史+地理', 15.63, '物理'], ['物理+历史+技术', 15.63, '物理'], ['物理+生物+地理', 15.63, '物理'], ['物理+生物+技术', 15.63, '物理'], ['物理+地理+技术', 15.63, '物理'], ['化学+政治+历史', 15.53, '化学'], ['化学+政治+生物', 15.53, '化学'], ['化学+政治+地理', 15.53, '化学'], ['化学+政治+技术', 15.53, '化学'], ['化学+历史+生物', 15.53, '化学'], ['化学+历史+地理', 15.53, '化学'], ['化学+历史+技术', 15.53, '化学'], ['化学+生物+地理', 15.53, '化学'], ['化学+生物+技术', 15.53, '化学'], ['化学+地理+技术', 15.53, '化学'], ['政治+历史+生物', 18.62, '政治'], ['政治+历史+地理', 18.62, '政治'], ['政治+历史+技术', 18.62, '政治'], ['政治+生物+地理', 18.62, '政治'], ['政治+生物+技术', 18.62, '政治'], ['政治+地理+技术', 18.62, '政治'], ['历史+生物+地理', 13.82, '历史'], ['历史+生物+技术', 13.82, '历史'], ['历史+地理+技术', 13.82, '历史'], ['生物+地理+技术', 19.25, '生物']]      
            },
            {
                type:'bar',
                stack: 'All',
                label: {
                    normal: {
                        fontSize: 9,
                        show: true,
                        align: 'center'
                    }
                },
                itemStyle: {
                    color: '#a3d1d1'
                },
                data: [['物理+化学+政治', 15.53, '化学'], ['物理+化学+历史', 15.53, '化学'], ['物理+化学+生物', 15.53, '化学'], ['物理+化学+地理', 15.53, '化学'], ['物理+化学+技术', 15.53, '化学'], ['物理+政治+历史', 18.62, '政治'], ['物理+政治+生物', 18.62, '政治'], ['物理+政治+地理', 18.62, '政治'], ['物理+政治+技术', 18.62, '政治'], ['物理+历史+生物', 13.82, '历史'], ['物理+历史+地理', 13.82, '历史'], ['物理+历史+技术', 13.82, '历史'], ['物理+生物+地理', 19.25, '生物'], ['物理+生物+技术', 19.25, '生物'], ['物理+地理+技术', 14.44, '地理'], ['化学+政治+历史', 18.62, '政治'], ['化学+政治+生物', 18.62, '政治'], ['化学+政治+地理', 18.62, '政治'], ['化学+政治+技术', 18.62, '政治'], ['化学+历史+生物', 13.82, '历史'], ['化学+历史+地理', 13.82, '历史'], ['化学+历史+技术', 13.82, '历史'], ['化学+生物+地理', 19.25, '生物'], ['化学+生物+技术', 19.25, '生物'], ['化学+地理+技术', 14.44, '地理'], ['政治+历史+生物', 13.82, '历史'], ['政治+历史+地理', 13.82, '历史'], ['政治+历史+技术', 13.82, '历史'], ['政治+生物+地理', 19.25, '生物'], ['政治+生物+技术', 19.25, '生物'], ['政治+地理+技术', 14.44, '地理'], ['历史+生物+地理', 19.25, '生物'], ['历史+生物+技术', 19.25, '生物'], ['历史+地理+技术', 14.44, '地理'], ['生物+地理+技术', 14.44, '地理']]
            },
            {
                type:'bar',
                stack: 'All',
                label: {
                    normal: {
                        fontSize: 9,
                        show: true,
                        align: 'center'
                    }
                },
                itemStyle: {
                    color: '#bebebe'
                },
                data: [['物理+化学+政治', 18.62, '政治'], ['物理+化学+历史', 13.82, '历史'], ['物理+化学+生物', 19.25, '生物'], ['物理+化学+地理', 14.44, '地理'], ['物理+化学+技术', 2.7, '技术'], ['物理+政治+历史', 13.82, '历史'], ['物理+政治+生物', 19.25, '生物'], ['物理+政治+地理', 14.44, '地理'], ['物理+政治+技术', 2.7, '技术'], ['物理+历史+生物', 19.25, '生物'], ['物理+历史+地理', 14.44, '地理'], ['物理+历史+技术', 2.7, '技术'], ['物理+生物+地理', 14.44, '地理'], ['物理+生物+技术', 2.7, '技术'], ['物理+地理+技术', 2.7, '技术'], ['化学+政治+历史', 13.82, '历史'], ['化学+政治+生物', 19.25, '生物'], ['化学+政治+地理', 14.44, '地理'], ['化学+政治+技术', 2.7, '技术'], ['化学+历史+生物', 19.25, '生物'], ['化学+历史+地理', 14.44, '地理'], ['化学+历史+技术', 2.7, '技术'], ['化学+生物+地理', 14.44, '地理'], ['化学+生物+技术', 2.7, '技术'], ['化学+地理+技术', 2.7, '技术'], ['政治+历史+生物', 19.25, '生物'], ['政治+历史+地理', 14.44, '地理'], ['政治+历史+技术', 2.7, '技术'], ['政治+生物+地理', 14.44, '地理'], ['政治+生物+技术', 2.7, '技术'], ['政治+地理+技术', 2.7, '技术'], ['历史+生物+地理', 14.44, '地理'], ['历史+生物+技术', 2.7, '技术'], ['历史+地理+技术', 2.7, '技术'], ['生物+地理+技术', 2.7, '技术']]
            }
        ]
    };
    return (
        <Card>
            <Card.Header>
                <h4>单科组合选择排名</h4>
            </Card.Header>
            <Card.Body>
                <Ec option={option} h='350px'/>
            </Card.Body>
        </Card>
    )
}