import React from 'react';
import { Card , Dropdown , DropdownButton } from 'react-bootstrap';
import Ec from './Ec';

const xlabel = [['虞老师', '蒋老师', '傅老师', '谢老师', '顾老师', '陈老师', '唐老师', '洪老师', '张老师', '张老师', '蒋老师', '岑老师', '黄老师', '陈老师', '郑老师', '徐老师', '孙老师', '叶老师', '杜老师', '朱老师', '马老师', '刘老师', '王老师', '潘老师', '张老师', '周老师', '李老师'], ['胡老师', '李老师', '贾老师', '黄老师', '戴老师', '牟老师', '杨老师', '朱老师', '潘老师', '杜老师', '张老师', '胡老师', '童老师', '吕老师', '张老师', '郑老师', '周老师', '翁老师', '闵老师', '梁老师', '邬老师', '鲍老师', '范老师', '鲁老师', '吕老师', '沈老师', '周老师', '张老师', '周老师', '朱老师', '胡老师'], ['周老师', '程老师', '陈老师', '王老师', '袁老师', '周老师', '曹老师', '陈老师', '沈老师', '朱老师', '吴老师', '王老师', '何老师', '赵老师', '王老师', '戴老师', '周老师', '武老师', '王老师', '陈老师', '高老师', '陈老师', '张老师', '郑老师', '周老师', '何老师', '郑老师', '李老师', '王老师', '毕老师', '徐老师', '王老师', '王老师', '牟老师', '熊老师', '夏老师', '李老师'], ['王老师', '夏老师', '邬老师', '贺老师', '何老师', '袁老师', '何老师', '杨老师', '陈老师', '陈老师', '叶老师', '杨老师', '庄老师', '张老师', '张老师', '孙老师', '钱老师', '鲍老师', '陈老师', '余老师'], ['邓老师', '吕老师', '王老师', '阮老师', '汪老师', '林老师', '黄老师', '郑老师', '张老师', '俞老师', '陈老师', '郭老师', '周老师', '王老师', '朱老师', '张老师', '盛老师', '贾老师', '徐老师', '章老师'], ['高老师', '徐老师', '王老师', '庄老师', '王老师', '李老师', '陈老师', '冯老师', '李老师', '王老师'], ['王老师', '陈老师', '刘老师', '周老师', '潘老师', '谢老师', '张老师', '张老师', '黎老师'], ['范老师', '陈老师', '王老师', '杨老师', '邵老师', '史老师', '任老师', '陈老师', '苏老师', '吴老师', '周老师', '陈老师'], ['王老师', '刘老师', '夏老师', '吴老师', '严老师', '王老师', '李老师', '陈老师', '蔡老师', '张老师', '乐老师']]

const dataset = [[77.68, 79.92, 75.64, 80.96, 80.0, 82.32, 78.07, 79.41, 86.71, 82.47, 80.41, 80.38, 72.69, 84.31, 80, 82.47, 77.31, 77.97, 80, 82.57, 81.88, 72.79, 80, 80, 82.45, 80.45, 76.46], [80, 80, 79.12, 84.66, 80.0, 76.05, 81.62, 79.06, 79.02, 77.84, 72.36, 80.52, 78.96, 78.28, 80, 85.06, 80.65, 80, 75.58, 80, 76.48, 80, 76.99, 78.55, 80, 82.66, 84.18, 84.5, 75.16, 85.19, 80], [0.0, 0.0, 80, 82.11, 79.88, 80.75, 84.68, 0.0, 82.13, 80.0, 78.09, 0.0, 83.38, 80.7, 0.0, 81.79, 80, 78.34, 83.45, 76.21, 0.0, 84.49, 0.0, 84.61, 80, 80, 76.62, 83.46, 0.0, 80, 82.71, 80, 81.22, 78.54, 70.57, 69.25, 83.76], [80, 80, 80.81, 80, 80, 84.03, 78.52, 80, 76.38, 80, 80, 80.0, 76.32, 80, 80, 80, 80, 78.91, 83.86, 83.31], [80, 80, 80.0, 75.68, 72.86, 80, 80.78, 80, 80, 81.55, 80, 77.0, 80, 83.81, 80, 80, 80, 79.2, 83.37, 78.39], [80, 83.53, 80, 82.8, 74.09, 80, 81.09, 79.61, 83.25, 75.72], [76.87, 84.12, 80, 80, 78.64, 74.36, 80, 80, 83.32], [81.28, 80, 77.64, 76.5, 80, 80, 83.29, 80.7, 80, 80, 78.41, 80.37], [79.41, 80, 80, 77.97, 80, 80, 82.17, 80, 78.6, 80, 82.24]]

const average = [[80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80], [80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]]


export default class extends React.Component {
    constructor(props) {
        super(props);
        this.state = {
            subName: undefined,
        };
        this.option = {};
        this.subArr = ['语文', '数学', '英语', '物理', '化学', '政治', '历史', '生物', '地理'];
    }
    setOption(subName) {
        const idx = this.subArr.indexOf(subName);
        this.option = {
            color: ['#e79d88', '#656765'],
            title: {
                text: subName + '教师',
                left: 'center',
                textStyle: {
                    fontSize: 15,
                    fontWeight: 500
                }
            },
            legend: {
                bottom: 'bottom',
                right: 'right'
            },
            tooltip: {
                trigger: 'axis',
                axisPointer: {
                    axis: 'angle',
                    type: 'shadow',
                },
            },
            angleAxis: {
                type: 'category',
                boundaryGap: false,
                data: xlabel[idx].map(item => item[0]),
            },
            radiusAxis: [{
                axisLabel: {
                    show: false,
                },
                axisTick: {
                    show: false
                },
                axisLine: {show: false},
                splitLine: {
                    lineStyle: {
                        color: '#eeeeee',
                        type: 'dashed'
                    }
                },
                min: 60,
                max: 90
            }],
            polar: {
                center: ['50%', '54%'],
                radius: '68%'
            },
            series: [{
                name: '教师水平',
                type: 'bar',
                data: dataset[idx],
                coordinateSystem: 'polar',
            }, {
                name: '平均水平',
                type: 'line',
                showSymbol: false,
                smooth: true,
                data: average[idx],
                coordinateSystem: 'polar',
            }]
        };
        this.setState({
            subName: subName
        });
    }
    componentWillMount() {
        this.setOption('语文');
    }
    render() {
        return (
            <Card>
                <Card.Header>
                    <h4>1-2-1 教师水平评估</h4>
                    <DropdownButton className='ml-2' bsPrefix='drop-down-btn' alignRight title="选择学科">
                        {this.subArr.map((items, index) => {
                            return <Dropdown.Item
                                key={index}
                                bsPrefix='drop-down-items'
                                onClick={this.setOption.bind(this, items)}>{items}</Dropdown.Item>;
                        })}
                    </DropdownButton>
                </Card.Header>
                <Card.Body>
                    <Ec option={this.option} h='300px' resetOption={true}/>
                </Card.Body>
            </Card>
        )
    }
}